# Задача 26: Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8
# A = int(input())
# B = int(input())
# def f(A):
#     if A==0:
#         return f(A)
#     else:
#         return A**B
# print(f(A))




# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
#  Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
# 2 2
# # # 4
# A = int(input('Введите первое число: '))
# B = int(input('Введите второе число: '))
# def Sum(A, B):
#     if B>0:
#         return A+B
#     else:
#         return A
# print(Sum(A, B))


